app/controllers/songs_controller.rb

INSERT INTO "songs" ("title", "artist", "duration", "isfave", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Innocence 3"], ["artist", "Kenny G"], ["duration", "3.0"], ["isfave", false], ["created_at", "2020-08-06 18:45:39.232890"], ["updated_at", "2020-08-06 18:45:39.232890"]]
---
  def create
    @song = Song.new(song_params)

    if @song.save

UPDATE "songs" SET "isfave" = $1, "updated_at" = $2 WHERE "songs"."id" = $3  [["isfave", true], ["updated_at", "2020-08-06 15:55:01.164926"], ["id", 1]]
---
  def update
    if @song.update(song_params)

DELETE FROM "songs" WHERE "songs"."id" = $1  [["id", 1]]
---
  def destroy
    @song.destroy

SELECT "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
    def set_song
      @song = Song.find(params[:id])